{"statement":{"language":"es","images":[],"sources":[],"markdown":"# Descripción\nHay $R$ robots en una gráfica completa de $N$ vértices y una bomba en el vértice $0$ de la misma: tu objetivo es usar los robots para alejar la bomba lo más posible del vértice $0$. Cada robot comienza en algún vértice y tiene una cantidad de energía que puede usar para recorrer la gráfica. Cuando un robot alcanza la bomba, éste puede cargarla y llevársela (el robot gasta la misma cantidad de energía caminando con o sin la bomba); el robot puede soltar la bomba en cualquier momento o bien, soltarla hasta que se acabe su energía y ya no pueda avanzar más. Si fuera posible, el siguiente robot puede ir a recoger la bomba en la posición en la que quedó para seguir alejándola. Los robots trabajan en estricto orden secuencial según el orden dado por la entrada. Escribe un programa que determine qué tan lejos puede alejarse la bomba si se usan los robots de manera óptima. Los robots pueden soltar la bomba en un vértice o incluso en una posición fraccionaria dentro de una arista.\n\n# Entrada\nUn entero $N$ seguido de la matriz de adyacencia de una gráfica completa de $N$ vértices (los vértices se numeran implícitamente de $0$ a $N-1$ y cada entrada de la matriz es un entero que denota la longitud de la arista que une los vértices respectivos). Posteriormente, un entero $R$ seguido de $R$ parejas de enteros $V, E$ donde la $i$-ésima pareja denota el vértice inicial y la energía del $i$-ésimo robot. Puedes suponer que $0 \\leq R < N \\leq 50$ y que todas las longitudes y energías están en el rango de $0$ a $1000$.\n\n# Salida\nUn real que sea la distancia máxima a la que puede alejarse la bomba del vértice $0$. La respuesta se considerará correcta si numéricamente está razonablemente cerca de la respuesta exacta.\n\n# Ejemplo\n||input\n3\n0 2 2\n2 0 3\n2 3 0\n2\n1 3\n2 4\n||output\n2\n||description\nEl primer robot gasta dos unidades de energía en llegar al vértice $0$ y recoger la bomba. Después gasta una unidad de energía en cargarla por la arista $0\\textrm{--}2$ y se queda sin energía a media arista.\nEl segundo robot gasta una unidad de energía en ir por la bomba a la arista y otra una de energía en regresar al vértice $2$ de donde ya no puede sacarla para seguir alejándola por falta de energía.\n||input\n3\n0 1 1\n1 0 3\n1 3 0\n1\n2 5\n||output\n2.5\n||description\nEl único robot gasta dos unidades de energía (una de ida y otra de regreso) para traer la bomba del vértice $0$ al vértice $2$. Después tiene energía suficiente para dejar la bomba a la mitad de la arista $2\\textrm{--}1$. Aunque el robot tiene energía suficiente para recorrer esa arista completa, ambos extremos están a la misma distancia del vértice $0$ y el punto más lejano al vértice $0$ es justo la mitad de la arista.\n||end\n"},"settings":{"cases":{"statement_001":{"in":"3\n0 2 2\n2 0 3\n2 3 0\n2\n1 3\n2 4","out":"2","weight":1},"statement_002":{"in":"3\n0 1 1\n1 0 3\n1 3 0\n1\n2 5","out":"2.5","weight":1}},"limits":{"ExtraWallTime":"0s","MemoryLimit":33554432,"OutputLimit":10240,"OverallWallTimeLimit":"1m0s","TimeLimit":"4s"},"validator":{"name":"token-numeric","tolerance":1.0e-9}},"problem_id":10160,"title":"Alejando la bomba en la gráfica","alias":"Alejando-la-bomba-en-la-grafica","input_limit":10240,"visits":0,"submissions":2,"accepted":0,"difficulty":null,"creation_date":1577929476,"source":"UAM Azcapotzalco 2020","order":"normal","visibility":2,"email_clarifications":false,"allow_user_add_tags":true,"show_diff":"none","quality_seal":true,"version":"40a299cc007e031d8298e90e53e4ff31b02e7c59","commit":"3245ab5350282ec2813d14e142c9901e063aa4f7","nominationStatus":{"alreadyReviewed":false,"dismissed":false,"dismissedBeforeAc":false,"nominated":false,"nominatedBeforeAc":false,"language":"","canNominateProblem":false,"solved":false,"tried":false},"problemsetter":{"username":"rcc","classname":"user-rank-international-master","name":"rcc","creation_date":1577929476},"languages":["c11-gcc","c11-clang","cpp11-gcc","cpp11-clang","cpp17-gcc","cpp17-clang","java","py2","py3","rb","cs","pas","hs","lua"],"accepts_submissions":true,"karel_problem":false,"limits":{"input_limit":"10 KiB","memory_limit":"32 MiB","overall_wall_time_limit":"1m0s","time_limit":"4s"},"points":100,"score":0,"status":"ok","_id":"6186d39e876e6455044328"}