{"statement":{"language":"es","images":[],"sources":[],"markdown":"# Descripción\n\nJaime acaba de aprender el juego de “cara o escudo” (o “cara o corona”). Este juego consiste en lanzar una moneda hacia el aire, permitiéndole girar y observar si la moneda aterriza con la “cara” o el “escudo” boca arriba.\n\nEl profesor de matemáticas le explicó a Jaime que jugando el juego de cara o escudo varias veces, se puede obtener una secuencia de resultados. Por ejemplo, la lista completa de las secuencias posibles al jugar cara o escudo 3 veces, es la siguiente:\n\n$CCC, CCE, CEE, CEC, EEE, ECE, EEC, ECC$\n\n*Fig 1.Todas las secuencias de cara o escudo de longitud 3.\nC singifica cara, E escudo*\n\n\nEl profesor le explicó que aunque los resultados de cada juego sean aleatorios, se pueden obtener todas las posibles permutaciones de una longitud n, si se juega cara o escudo suficientes veces.\n\nJaime quiere comprobar si lo que le dijo su profesor es cierto, y para eso, escribe un programa que identifica si todas las combinaciones para una secuencia de longitud n existen en un string input. Por ejemplo, en la siguiente cadena de caracteres, se pueden obtener todas las posibles secuencias de resultados de longitud 2.\n\n\n$ECECCEEECCE$\n\n*Fig 2. Un string the longitud total k = 11, donde se encuentran todas las posibles secuencias de longitud n = 2.*\n\n$E|CE|CC|EE|EC|CE$\n\n*Fig 3. Divisiones necesarias para obtener todas las posibles secuencias de longitud n = 2, Empezando después del primer caracter, p = 1*\n\n¿Puedes ayudarle a Jaime? Escribe un programa, que calcule, dado input string S, si es posible obtener todas las combinaciones de una secuencia de “cara o escudo” de tamaño n. Se debe dar un ńumero p, que indica en qué posición se empieza a dividir y contar las secuencias. Si hay varias soluciones para el problema, da cual sea tenga el valor de n más alto. Una secuencia no puede ser repetida en la sucesión.\n\n\n# Entrada\n\nLa entrada corresponderá al string que simboliza el resultado de muchos juegos de cara o escudo.\nLa entrada puede tener hasta 11000 caracteres.\n\n# Salida\n\nLa salida consistirá de dos números. Primero un número *n* y *p*, en este orden, descritos en el problema. Si hay varios valores de *n* o *p* que satisfagan una solución, escoge la solución que primero tenga el mayor valor de *n*, y después el menor valor de *p*.\n\n# Ejemplo\n\n||input\nCEEEE\n||output\n1 0\n||description\nSi se empieza desde la posición 0, se puede obtener $C | E$, que corresponde a todas las combinaciones de longitud 1.\n||input\nECECCEEECCE\n||output\n2 1\n||description\nSi se empieza desde la posición 1, se puede obtener $E|CE|CC|EE|EC|CE$, que corresponde a todas las combinaciones de longitud 2. Tomar nota que la solución no es $2, 0$ por que esto resultaría en combinaciones repetidas después de realizar las subdivisiones de longitud 2.\n||end\n"},"settings":{"cases":{"statement_001":{"in":"CEEEE","out":"1 0","weight":1},"statement_002":{"in":"ECECCEEECCE","out":"2 1","weight":1}},"limits":{"ExtraWallTime":"0s","MemoryLimit":335544320,"OutputLimit":65536,"OverallWallTimeLimit":"1m0s","TimeLimit":"2s"},"validator":{"name":"token","tolerance":1.0e-9}},"problem_id":10810,"title":"Cara o escudo","alias":"Cara-o-Escudo","input_limit":65536,"visits":0,"submissions":53,"accepted":5,"difficulty":null,"creation_date":1586623723,"source":"1er Copa Centroamericana de Programación","order":"normal","visibility":2,"email_clarifications":true,"allow_user_add_tags":false,"show_diff":"none","quality_seal":true,"version":"2f63de30ad0815d4442f6544b9b95ca7dee7dca8","commit":"9eff73e0b89f1ed055e945eb31f8a347c28addaf","nominationStatus":{"alreadyReviewed":false,"dismissed":false,"dismissedBeforeAc":false,"nominated":false,"nominatedBeforeAc":false,"language":"","canNominateProblem":false,"solved":false,"tried":false},"problemsetter":{"username":"alanrmorales","classname":"user-rank-unranked","name":"Alan Morales","creation_date":1586623723},"languages":["c11-gcc","c11-clang","cpp11-gcc","cpp11-clang","cpp17-gcc","cpp17-clang","java","py2","py3","rb","cs","pas","hs","lua"],"accepts_submissions":true,"karel_problem":false,"limits":{"input_limit":"64 KiB","memory_limit":"320 MiB","overall_wall_time_limit":"1m0s","time_limit":"2s"},"points":38.69,"score":0,"status":"ok","_id":"6186d63714a8d444675295"}