{"statement":{"language":"es","images":[],"sources":[],"markdown":"# Descripción\n\n\nEn un banco se realizan diariamente miles de transacciones. El objetivo de esta práctica es simular de una manera muy básica lo que ocurre con las cuentas de los clientes.\nGeneralmente todo cliente de un banco tiene asociado un número de cliente $nc$, un nombre $s$ y al menos una cuenta, sin embargo en esta práctica consideraremos que todo cliente tiene una sola cuenta y ésta es de débito. Para abrir una cuenta de débito es necesario realizarle un depósito inicial $A$. A partir de allí se pueden realizar tantos depósitos $D$, consultas $C$ o retiros $E$ (siempre que haya dinero) como el cliente desee. Si en algún momento lo desea el cliente puede dar de baja $B$ una cuenta y evidentemente dejarla en ceros.\n\n# Entrada\n\nLa primer línea de la entrada consistirá de un entero $n$ que denota el número de transacciones bancarias a procesar seguido de $n$ líneas las transacciones. El primer valor sera un caracter $c$, que podrá ser alguna de las siguientes opciones:\n\n - Letra A: indicará la apertura de una cuenta. La letra será seguida de un número de cliente $nc$ (pues el cliente es nuevo), seguido de una cadena $s$ que denota el nombre (el nombre no contendrá espacios), seguido del monto inicial $p$ de apertura de la cuenta. Ejemplo: A 7 juan 500\n - Letra B: indicará la baja de una cuenta. La letra será seguida de un número de cliente $nc$. Ejemplo: B 7\n - Letra C: indicará la consulta del saldo de cliente. La letra será seguida de un número de cliente $nc$. Ejemplo: C 7\n - Letra D: indicará un depósito en la cuenta de un cliente. La letra será seguida de un número de cliente $nc$ y el monto a depositar $p$. Ejemplo: D 7 500\n - Letra E: indicará un retiro en la cuenta de un cliente. La letra será seguida de un número de cliente $nc$ y el monto a retirar $p$. Ejemplo: E 7 500\n\nPuede suponer que $1 \\le n \\le 1000$, $1 \\le nc \\le 10$, $1 \\le p \\le 10000$ y que la longitud del nombre será de a lo más 10 caracteres.\n\n# Salida\n\nSu programa deberá imprimir una línea de salida por cada línea de entrada según sea la letra de entrada. A continuación se describe que hacer en cada caso.\n\n - Letra A: Sólo se realizará el alta de una cuenta si no existe ya otra cuenta con el mismo número de cliente. En caso de que se pueda realizar el alta deberá imprimir la palabra OK y en caso contrario la palabra ERROR.\n - Letra B: Sólo se realizará la baja de una cuenta si es que el cliente existe al momento de solicitarla. En caso de que se pueda realizar la baja deberá imprimir la palabra OK  y en caso contrario la palabra ERROR.\n - Letra C: Sólo se realizará la consulta de una cuenta si es que el cliente existe al momento de solicitarla. En caso de existir deberá imprimir el nombre del cliente seguido del monto actual en la cuenta, en caso contrario deberá imprimir la palabra ERROR.\n - Letra D: Sólo se realizará el depósito a una cuenta si es que el cliente existe al momento de solicitarlo. En caso de existir deberá imprimir el nombre del cliente seguido del monto actual en la cuenta después del depósito, en caso contrario deberá imprimir la palabra ERROR.\n - Letra E: Sólo se realizará el retiro de una cuenta si es que el cliente existe al momento de solicitarlo y el monto a retirar es menor o igual que el saldo de la cuenta. En caso de que el movimiento se pueda realizar deberá imprimir el nombre del cliente seguido del monto actual en la cuenta después del retiro, en caso contrario deberá imprimir la palabra ERROR.\n\n# Ejemplo\n\n||input\n10\nA 7 juan 500\nB 1\nC 7\nD 7 500\nE 7 1001\nB 7\nE 7 200\nC 7\nA 7 juan 250\nE 7 200\n||output\nOK\nERROR\njuan 500\njuan 1000\nERROR\nOK\nERROR\nERROR\nOK\njuan 50\n||end\n\n\n||input\n\n10\nA 7 juan 500\nC 2\nE 7 500\nE 7 1\nD 7 2000\nA 7 juan 500\nE 7 500\nE 7 500\nE 7 500\nE 7 500\n||output\nOK\nERROR\njuan 0\nERROR\njuan 2000\nERROR\njuan 1500\njuan 1000\njuan 500\njuan 0\n||end\n"},"settings":{"cases":{"statement_001":{"in":"10\nA 7 juan 500\nB 1\nC 7\nD 7 500\nE 7 1001\nB 7\nE 7 200\nC 7\nA 7 juan 250\nE 7 200","out":"OK\nERROR\njuan 500\njuan 1000\nERROR\nOK\nERROR\nERROR\nOK\njuan 50","weight":1}},"limits":{"ExtraWallTime":"0s","MemoryLimit":33554432,"OutputLimit":16384,"OverallWallTimeLimit":"10s","TimeLimit":"1s"},"validator":{"name":"token"}},"problem_id":2489,"title":"El banco","alias":"El-banco","input_limit":10240,"visits":0,"submissions":44,"accepted":16,"difficulty":null,"creation_date":1425518395,"source":"UAM 2014","order":"normal","visibility":2,"email_clarifications":false,"allow_user_add_tags":true,"show_diff":"none","quality_seal":true,"version":"906440fae15c471e9d00c1759871e9d372c94ed0","commit":"a944d16c0b02e8f9ed2d63b83049519a0fab1319","nominationStatus":{"alreadyReviewed":false,"dismissed":false,"dismissedBeforeAc":false,"nominated":false,"nominatedBeforeAc":false,"language":"","canNominateProblem":false,"solved":false,"tried":false},"problemsetter":{"username":"sergio10barca","classname":"user-rank-international-master","name":"Sergio Luis Pérez Pérez","creation_date":1425518395},"languages":["c11-gcc","c11-clang","cpp11-gcc","cpp11-clang","cpp17-gcc","cpp17-clang","java","py2","py3","rb","cs","pas","hs","lua"],"accepts_submissions":true,"karel_problem":false,"limits":{"input_limit":"10 KiB","memory_limit":"32 MiB","overall_wall_time_limit":"10s","time_limit":"1s"},"points":24.47,"score":0,"status":"ok","_id":"6186d3a55bbec390641786"}